OdRxSpecifiedValueType.delete(System.Void*)
\details
Enables use of the delete operator.

OdRxSpecifiedValueType.new(System.UInt64)
\details
Enables a new operator.

OdRxSpecifiedValueType.op_Inequality(OdRxSpecifiedValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Negative comparison operator.
\param rhs [in] Value type to compare with the current value type.
\returns
True if value types are not equal; false otherwise.

OdRxSpecifiedValueType.op_Equality(OdRxSpecifiedValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator.
\param rhs [in] Value type to compare with the current value type.
\returns
True if value types are equal; false otherwise.

OdRxSpecifiedValueType.typePath
\details
Retreives an ANSI string in format of path that elaborates the sense of
value of the value type.
\returns
ANSI string with clarification of value sense.

OdRxSpecifiedValueType.createValue
\details
Creates a new wrapped value of this type.
\returns
Created wrapped value of this type.

OdRxSpecifiedValueType.subEqualTo(System.Void!System.Runtime.CompilerServices.IsConst*,System.Void!System.Runtime.CompilerServices.IsConst*)
\details
Compares two values of the underlying C++ type.
\param a [in] First value to compare.
\param b [in] Second value to compare.
\returns
True if compared values are equal; false otherwise.

OdRxSpecifiedValueType.subToString(System.Void!System.Runtime.CompilerServices.IsConst*,OdRxValueType.StringFormat)
\details
Converts a value to a string.
\param instance [in] Instance of the value to convert.
\param format   [in] Defines the format of the resulting string.
\returns
Converted value.
\remarks
Mostly for debug purposes.

OdRxSpecifiedValueType.rxObjectValue
\details
Returns the interface, that describes OdRxObject-descendant pointers.
\returns
Interface, describing OdRxObject-descendant pointers. NULL for types other
than OdRxObject-descendant pointers.

OdRxSpecifiedValueType.reference
\details
Returns the interface, that describes references (handlers).
\returns
Interface, describing references. NULL for non-reference types.

OdRxSpecifiedValueType.enumeration
\details
Implementation of the base class 'enumeration'.
\returns
Interface to the enumeration.

OdRxSpecifiedValueType.underlyingValueType
\details
Retrieves a pointer to the underlying value type (which coincide with the
actual ValueType of OdRxValue.m_value).
\returns
Pointer to the underlying value type.

OdRxSpecifiedValueType.#ctor(OdRxValueType!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Constructor which takes an original ValueType and a string that contains
additional specification of the type in "Folder/SubFolder/Type" format.
\param underlyingValueType [in] A pointer to the value type for the specification.
\param typePath            [in] A string for the value type specification.